Revit 2026 API

# InitialWattageIntensity(InitialWattageIntensity) Constructor

---

Creates a copy of the given initial wattage intensity object

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InitialWattageIntensity(
	InitialWattageIntensity other
)
```
```vb
Public Sub New (
	other As InitialWattageIntensity
)
```
```cpp
public:
InitialWattageIntensity(
	InitialWattageIntensity^ other
)
```
```fsharp
new :
        other : InitialWattageIntensity -> InitialWattageIntensity
```

#### Parameters

other InitialWattageIntensity

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

InitialWattageIntensity Class

InitialWattageIntensity Overload

Autodesk.Revit.DB.Lighting Namespace